Repository: GDB-11/blazor-poc
Catalog: Application.Core.Service/Shared/MessageResources/Messages.*.resx
Languages: es

# SC-US0001
source: User created successfully.
es: Usuario creado con éxito.

# EC-US0001
source: An error occurred while creating the user.
es: Ocurrió un error al crear el usuario.

# SC-US0002
source: User updated successfully.
es: Usuario actualizado con éxito.

# EC-US0002
source: An error occurred while updating the user.
es: Ocurrió un error al actualizar el usuario.

# SC-US0003
source: User deleted successfully.
es: Usuario eliminado con éxito.

# EC-US0003
source: An error occurred while deleting the user.
es: Ocurrió un error al eliminar el usuario.

# EC-US0004
source: The username already exists. Please choose a different username.
es: El nombre de usuario ya existe. Por favor, elija un nombre de usuario diferente.

# EC-US0005
source: The email already exists. Please choose a different email.
es: El correo electrónico ya existe. Por favor, elija un correo electrónico diferente.

# EC-US0006
source: You must accept the terms and conditions to continue.
es: Debe aceptar los términos y condiciones para continuar.

# TM-SW0001
source: Success!
es: ¡Éxito!

# TM-SW0003
source: Info
es: Ojo

# TM-SW0004
source: Warning
es: Atención

# Motto
source: Your lightweight and friendly tracker of ALL your movements!
es: ¡Tu rastreador liviano y confiable de TODOS tus movimientos!

# RegisterHeader
source: Create an account
es: Crea una cuenta

# UsernameLabel
source: Username
es: Nombre de usuario

# UsernamePlaceholder
source: MyUsername
es: MiUsuario

# PasswordLabel
source: Password
es: Contraseña

# EmailLabel
source: Email
es: Correo electrónico

# EmailPlaceholder
source: example@domain.com
es: ejemplo@dominio.com

# TermsAndConditionsLabel
source: I accept the Terms and Conditions
es: Acepto los términos y condiciones

# AlreadyHaveAnAccountText
source: Already have an account?
es: ¿Ya tienes una cuenta?

# CreateAccountButtonText
source: Create account
es: Crear cuenta

# LoginHereText
source: Login here
es: Inicie sesión aquí

# LogInButtonText
source: Sign In
es: Iniciar sesión

# LogInHeader
source: Sign in to your account
es: Iniciar sesión en su cuenta

# DontHaveAnAccountText
source: Don’t have an account yet?
es: ¿Aún no tienes una cuenta?

# ForgotPasswordText
source: Forgot password?
es: ¿Has olvidado tu contraseña?

# RememberMeLabel
source: Remember Me
es: Recordarme

# SignUpHereText
source: Sign up
es: Regístrate

# EC-US0007
source: Oops! It looks like this username is already taken. Please try a different one.
es: ¡Vaya! Parece que este nombre de usuario ya está en uso. Por favor, intenta con uno diferente.

# EC-DB0001
source: There was a problem with the database connection. Please contact support.
es: Hubo un problema con la conexión a la base de datos. Comuníquese con el servicio de soporte.

# EC-US0008
source: Oops! This email address is already registered. If you forgot your password, you can reset it.
es: ¡Vaya! Esta dirección de correo electrónico ya está registrada. Si olvidaste tu contraseña, puedes restablecerla.

# EC-US0009
source: Please enter a username.
es: Por favor, ingresa un nombre de usuario.

# EC-US0010
source: Please enter an email address.
es: Por favor, ingresa una dirección de correo electrónico.

# EC-US0011
source: Please enter a password.
es: Por favor, ingresa una contraseña.

# EC-US0012
source: The username you entered does not exist. Please check and try again.
es: El nombre de usuario que ingresaste no existe. Por favor, verifica e inténtalo de nuevo.

# EC-US0013
source: The password you entered is incorrect. Please try again.
es: La contraseña que ingresaste es incorrecta. Por favor, inténtalo de nuevo.

# EC-US0014
source: The user does not have a password. Please contact support.
es: El usuario no cuenta con una contraseña. Por favor, comunícate con el área de soporte.

# DashboardText
source: Dashboard
es: Panel

# LogOutText
source: Log Out
es: Cerrar sesión

# PortfoliosText
source: Portfolios
es: Carteras

# AddButtonText
source: Add
es: Agregar

# AddPortfolioModalTitleText
source: Add Portfolio
es: Agregar cartera

# EC-PO0001
source: An error occurred while creating the portfolio.
es: Ocurrió un error al crear la cartera.

# SC-PO0001
source: Portfolio created successfully.
es: Cartera creada con éxito.

# ActionTableHeaderText
source: Action
es: Opciones

# NameTableHeaderText
source: Name
es: Nombre

# PortfolioNameModalFormPlaceholderText
source: Example name
es: Nombre de ejemplo

# PortfolioNameModalFormText
source: Portfolio Name
es: Nombre de la cartera

# AddPortfolioModalButtonText
source: Add Portfolio
es: Agregar cartera

# EC-PO0002
source: An error occurred while updating the portfolio.
es: Ocurrió un error al actualizar la cartera.

# SC-PO0002
source: Portfolio updated successfully.
es: Cartera actualizada con éxito.

# EC-PO0003
source: An error occurred while deleting the portfolio.
es: Ocurrió un error al eliminar la cartera.

# SC-PO0003
source: Portfolio deleted successfully.
es: Cartera eliminada con éxito.

# EditPortfolioModalButtonText
source: Edit Portfolio
es: Editar cartera

# EditPortfolioModalTitleText
source: Edit Portfolio
es: Editar cartera

# ConfirmationQuestion
source: Are you sure?
es: ¿Desea continuar?

# TM-SW0005
source: Cancelled
es: Cancelado

# TM-SW0006
source: Deleted
es: Eliminado

# IC-PO0001
source: You will not be able to recover portfolio {0} and it's transactions!
es: ¡No podrás recuperar la cartera {0} y sus transacciones!

# IC-PO0004
source: Your portfolio {0} has been deleted.
es: Su cartera {0} ha sido eliminada.

# IC-PO0005
source: You kept portfolio {0}.
es: Mantuviste la cartera {0}.

# IC-PI0001
source: Add Asset
es: Agregar activo

# EC-AS0001
source: An error occurred while creating the asset registry.
es: Ocurrió un error al crear el registro del activo.

# SC-AS0001
source: Asset registry created successfully.
es: Registro del activo creado con éxito.

# EC-PI0001
source: An error occurred while creating the asset.
es: Ocurrió un error al crear el activo.

# SC-PI0001
source: Asset created successfully.
es: Activo creado con éxito.

# AddPortfolioItemModalButtonText
source: Add Asset
es: Agregar activo

# AddPortfolioItemModalTitleText
source: Add Asset
es: Agregar activo

# PortfolioItemNameModalFormText
source: Asset name
es: Nombre del activo

# IC-PI0002
source: Name
es: Nombre

# IC-PI0003
source: Ticker
es: Símbolo

# IC-PI0005
source: Action
es: Opciones

# IC-PI0006
source: Ticker
es: Símbolo

# IC-MC0001
source: Yes, delete it!
es: ¡Sí, quiero eliminar!

# IC-MC0002
source: No, keep it
es: No, olvídalo

# IC-PI0008
source: You will not be able to recover asset {0} and it's transactions!
es: ¡No podrás recuperar el activo {0} y sus transacciones!

# IC-PI0009
source: Your asset {0} has been deleted.
es: Su activo {0} ha sido eliminado.

# IC-PI0010
source: You kept asset {0}.
es: Mantuviste el activo {0}.

# EC-PI0002
source: An error occurred while deleting the asset.
es: Ocurrió un error al eliminar el activo.

# SC-PI0002
source: Asset deleted successfully.
es: Activo eliminado con éxito.

# EC-PI0003
source: An error occurred while deleting the portfolio assets.
es: Ocurrió un error al eliminar los activos de la cartera.

# SC-PI0003
source: Portfolio assets deleted successfully.
es: Activos eliminados con éxito.

# EC-TX0001
source: An error occurred while creating the transaction.
es: Ocurrió un error al crear la transacción.

# EC-TX0002
source: An error occurred while updating the transaction.
es: Ocurrió un error al actualizar la transacción.

# EC-TX0003
source: An error occurred while deleting the transaction.
es: Ocurrió un error al eliminar la transacción.

# EC-TX0004
source: An error occurred while deleting the asset transactions.
es: Ocurrió un error al eliminar las transacciones del activo.

# SC-TX0001
source: Transaction created successfully.
es: Transacción creada con éxito.

# SC-TX0002
source: Transaction updated successfully.
es: Transacción actualizada con éxito.

# SC-TX0003
source: Transaction deleted successfully.
es: Transacción eliminada con éxito.

# SC-TX0004
source: Asset transactions deleted successfully.
es: Transacciones del activo eliminadas con éxito.

# EC-TX0005
source: An error occurred while deleting the portfolio transactions.
es: Ocurrió un error al eliminar las transacciones de la cartera.

# SC-TX0005
source: Portfolio tansactions deleted successfully.
es: Transacciones de la cartera eliminadas con éxito.

# AssetText
source: Assets
es: Activos
